robertinant/emt/src/ti/runtime/wiring/cc13xx/variants/CC1310_LAUNCHXL/Board_init.c
/*
 *  ========================= IO driver initialization =========================
 *  From main, PIN_init(BoardGpioInitTable) should be called to setup safe
 *  settings for this board.
 *  When a pin is allocated and then de-allocated, it will revert to the state
 *  configured in this table
*/
#include <ti/drivers/PIN.h>
#include  <ti/drivers/pin/PINCC26XX.h>

const PIN_Config BoardGpioInitTable[] = {
    Board_RLED   | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,         /* LED initially off             */
    Board_GLED   | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,         /* LED initially off             */
    Board_BTN1   | PIN_INPUT_EN | PIN_PULLUP | PIN_IRQ_BOTHEDGES | PIN_HYSTERESIS,            /* Button is active low          */
    Board_BTN2   | PIN_INPUT_EN | PIN_PULLUP | PIN_IRQ_BOTHEDGES | PIN_HYSTERESIS,            /* Button is active low          */
    Board_UART_RX | PIN_INPUT_EN | PIN_PULLDOWN,                                              /* UART RX via debugger back channel */
    Board_UART_TX | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL,                        /* UART TX via debugger back channel */
    Board_SPI0_MOSI | PIN_INPUT_EN | PIN_PULLDOWN,                                            /* SPI master out - slave in */
    Board_SPI0_MISO | PIN_INPUT_EN | PIN_PULLDOWN,                                            /* SPI master in - slave out */
    Board_SPI0_CLK | PIN_INPUT_EN | PIN_PULLDOWN,                                             /* SPI clock */

    PIN_TERMINATE
};

PINCC26XX_HWAttrs PINCC26XX_hwAttrs = {
    .intPriority = ~0,
    .swiPriority = 0
};

/*============================================================================*/

/*
 * ======== GPIO driver ========
 */

#include <ti/drivers/GPIO.h>
#include <ti/drivers/gpio/GPIOCC26XX.h>

/* GPIO configuration structure definitions */

GPIO_PinConfig gpioPinConfigs[] = {
    /* port_pin */
    GPIOCC26XX_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  0  - dummy */
                          
    /* pins 1-10 */
    GPIOCC26XX_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  1  - 3.3V */
    GPIOCC26XX_DIO_23 | GPIO_DO_NOT_CONFIG,     /*  2  - DIO_23 */
    GPIOCC26XX_DIO_03 | GPIO_DO_NOT_CONFIG,     /*  3  - DIO_03 */
    GPIOCC26XX_DIO_02 | GPIO_DO_NOT_CONFIG,     /*  4  - DIO_02 */
    GPIOCC26XX_DIO_22 | GPIO_DO_NOT_CONFIG,     /*  5  - DIO_22 */
    GPIOCC26XX_DIO_24 | GPIO_DO_NOT_CONFIG,     /*  6  - DIO_24 */
    GPIOCC26XX_DIO_10 | GPIO_DO_NOT_CONFIG,     /*  7  - DIO_10 */
    GPIOCC26XX_DIO_21 | GPIO_DO_NOT_CONFIG,     /*  8  - DIO_21 */
    GPIOCC26XX_DIO_04 | GPIO_DO_NOT_CONFIG,     /*  9  - DIO_04 */
    GPIOCC26XX_DIO_05 | GPIO_DO_NOT_CONFIG,     /*  10 - DIO_05 */
                          
    /* pins 11-20 */
    GPIOCC26XX_DIO_15 | GPIO_DO_NOT_CONFIG,     /*  11 - DIO_15 */
    GPIOCC26XX_DIO_14 | GPIO_DO_NOT_CONFIG,     /*  12 - DIO_14 */
    GPIOCC26XX_DIO_13 | GPIO_DO_NOT_CONFIG,     /*  13 - DIO_13 */
    GPIOCC26XX_DIO_08 | GPIO_DO_NOT_CONFIG,     /*  14 - DIO_08 */
    GPIOCC26XX_DIO_09 | GPIO_DO_NOT_CONFIG,     /*  15 - DIO_09 */
    GPIOCC26XX_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  16 - LPRST */
    GPIOCC26XX_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  17 - NC */
    GPIOCC26XX_DIO_11 | GPIO_DO_NOT_CONFIG,     /*  18 - DIO_11 */
    GPIOCC26XX_DIO_12 | GPIO_DO_NOT_CONFIG,     /*  19 - DIO_12 */
    GPIOCC26XX_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  20 - GND */
                          
    /* pins 21-30 */
    GPIOCC26XX_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  21 - 5V */
    GPIOCC26XX_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  22 - GND */
    GPIOCC26XX_DIO_25 | GPIO_DO_NOT_CONFIG,     /*  23 - DIO_25 */
    GPIOCC26XX_DIO_26 | GPIO_DO_NOT_CONFIG,     /*  24 - DIO_26 */
    GPIOCC26XX_DIO_27 | GPIO_DO_NOT_CONFIG,     /*  25 - DIO_27 */
    GPIOCC26XX_DIO_28 | GPIO_DO_NOT_CONFIG,     /*  26 - DIO_28 */
    GPIOCC26XX_DIO_29 | GPIO_DO_NOT_CONFIG,     /*  27 - DIO_29 */
    GPIOCC26XX_DIO_30 | GPIO_DO_NOT_CONFIG,     /*  28 - DIO_30 */
    GPIOCC26XX_DIO_00 | GPIO_DO_NOT_CONFIG,     /*  29 - DIO_00 */
    GPIOCC26XX_DIO_01 | GPIO_DO_NOT_CONFIG,     /*  30 - DIO_01 */
                          
    /* pins 31-40 */
    GPIOCC26XX_DIO_17 | GPIO_DO_NOT_CONFIG,     /*  31 - DIO_17 */
    GPIOCC26XX_DIO_16 | GPIO_DO_NOT_CONFIG,     /*  32 - DIO_16 */
    GPIOCC26XX_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  33 - TCK */
    GPIOCC26XX_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  34 - TMS */
    GPIOCC26XX_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  35 - BPRST */
    GPIOCC26XX_DIO_18 | GPIO_DO_NOT_CONFIG,     /*  36 - DIO_18 */
    GPIOCC26XX_DIO_19 | GPIO_DO_NOT_CONFIG,     /*  37 - DIO_19 */
    GPIOCC26XX_DIO_20 | GPIO_DO_NOT_CONFIG,     /*  38 - DIO_20 */
    GPIOCC26XX_DIO_06 | GPIO_DO_NOT_CONFIG,     /*  39 - DIO_06 */
    GPIOCC26XX_DIO_07 | GPIO_DO_NOT_CONFIG,     /*  40 - DIO_07 */
};

GPIO_CallbackFxn gpioCallbackFunctions[] = {
    /* port_pin */
    NULL,  /*  0  - dummy */

    /* pins 1-10 */
    NULL,  /*  1  - 3.3V */
    NULL,  /*  2  - DIO_23 */
    NULL,  /*  3  - DIO_03 */
    NULL,  /*  4  - DIO_02 */
    NULL,  /*  5  - DIO_22 */
    NULL,  /*  6  - DIO_24 */
    NULL,  /*  7  - DIO_10 */
    NULL,  /*  8  - DIO_21 */
    NULL,  /*  9  - DIO_04 */
    NULL,  /*  10 - DIO_05 */
                    
    /* pins 11-20 */
    NULL,  /*  11 - DIO_15 */
    NULL,  /*  12 - DIO_14 */
    NULL,  /*  13 - DIO_13 */
    NULL,  /*  14 - DIO_08 */
    NULL,  /*  15 - DIO_09 */
    NULL,  /*  16 - LPRST */
    NULL,  /*  17 - NC */
    NULL,  /*  18 - DIO_11 */
    NULL,  /*  19 - DIO_12 */
    NULL,  /*  20 - GND */
                    
    /* pins 21-30 */
    NULL,  /*  21 - 5V */
    NULL,  /*  22 - GND */
    NULL,  /*  23 - DIO_25 */
    NULL,  /*  24 - DIO_26 */
    NULL,  /*  25 - DIO_27 */
    NULL,  /*  26 - DIO_28 */
    NULL,  /*  27 - DIO_29 */
    NULL,  /*  28 - DIO_30 */
    NULL,  /*  29 - DIO_00 */
    NULL,  /*  30 - DIO_01 */
                    
    /* pins 31-40 */
    NULL,  /*  31 - DIO_17 */
    NULL,  /*  32 - DIO_16 */
    NULL,  /*  33 - TCK */
    NULL,  /*  34 - TMS */
    NULL,  /*  35 - BPRST */
    NULL,  /*  36 - DIO_18 */
    NULL,  /*  37 - DIO_19 */
    NULL,  /*  38 - DIO_20 */
    NULL,  /*  39 - DIO_06 */
    NULL,  /*  40 - DIO_07 */
};

/* User requested callback functions for the GPIO input signals */

